import React from "react";
import { ArticleNavigator } from "../../components/ArticleNavigator";
import Article from "../../components/Layouts/Article";

const title = "Политика конфиденциальности Orbis";
const description = `Добро пожаловать!
Данная политика конфиденциальности объясняет как мы собираем, используем, храним, защищаем и передаем вашу личную информацию через наши сервисы. 
`;

const content = `
## 1. Общие положения
1.1. Настоящие Правила являются официальным документом Администрации платформы платформы Orbis в лице команды разработчиков (далее – Администрация Платформы), и определяют порядок обработки и защиты информации о физических лицах, пользующихся услугами интернет-платформы Orbis (далее – Платформа) и ее сервисов (далее – Пользователи).
1.2. Целью настоящих Правил является обеспечение надлежащей защиты информации о пользователях, в том числе их персональных данных, от несанкционированного доступа и разглашения.
1.3. Отношения, связанные со сбором, хранением, распространением и защитой информации о пользователях Платформы, регулируются настоящими Правилами, иными официальными документами Администрации Платформы и действующим законодательством Российской Федерации.
1.4. Действующая редакция Правил, являющихся публичным документом, доступна любому пользователю сети Интернет при переходе по ссылке https://ыквеа/privacy. Администрация Платформы вправе вносить изменения в настоящие Правила. При внесении изменений в Правила Администрация Платформы уведомляет об этом пользователей путем размещения новой редакции Правил на Сайте по постоянному адресу https://ваыпр/privacy не позднее, чем за 10 дней до вступления в силу соответствующих изменений. Предыдущие редакции Правил хранятся в архиве документации Администрации Платформы.
1.5. Настоящие Правила разработаны и используются в соответствии с Правилами пользования Платформой Orbis, размещенными на Сайте по адресу https://vфвыа/terms. В случае наличия противоречий между настоящими Правилами и иными официальными документами Администрации Платформы применению подлежат настоящие Правила.
1.6. Регистрируясь и используя Платформу, Пользователь выражает свое согласие с условиями настоящих Правил.
1.7. В случае несогласия Пользователя с условиями настоящих Правил использование Платформы и его сервисов должно быть немедленно прекращено.
1.8. Если в соответствии с законом требуется получение отдельного согласия Пользователя на обработку персональных данных в связи с использованием Платформы, то такое согласие запрашивается у Пользователя только применительно к использованию Платформы. Запрос одного указанного согласия для всех социальных сетей и платформ социального взаимодействия не допускается.

## 2. Условия пользования Платформой
2.1. Оказывая услуги по использованию Платформы и его сервисов (далее – Услуги Платформы), Администрация Платформы, действуя разумно и добросовестно, считает, что Пользователь:
- обладает всеми необходимыми правами, позволяющими ему осуществлять регистрацию и использовать настоящую Платформу;
- указывает достоверную информацию о себе в объемах, необходимых для пользования Услугами Платформы;
- осознает, что информация на Платформе, размещаемая Пользователем о себе, может становиться доступной для других Пользователей Платформы и пользователей Интернета, может быть скопирована и распространена такими пользователями;
- осознает, что некоторые виды информации, переданные им другим Пользователям, не могут быть удалены самим Пользователем;
- ознакомлен с настоящими Правилами, выражает свое согласие с ними и принимает на себя указанные в них права и обязанности.

2.2. Администрация Платформы не проверяет достоверность получаемой (собираемой) информации о пользователях, за исключением случаев, когда такая проверка необходима в целях исполнения Администрацией Платформы обязательств перед пользователем.

## 3. Цели обработки информации
Администрация Платформы осуществляет обработку информации о Пользователях, в том числе их персональных данных, в целях выполнения обязательств Администрации Платформы перед Пользователями в отношении использования Платформы и его сервисов.

## 4. Состав информации о пользователях
### 4.1. Персональные данные Пользователей
Персональные данные Пользователей включают в себя:
- 4.1.1. предоставляемые Пользователями и минимально необходимые для регистрации на Платформе: имя, дата рождения и адрес электронной почты;
- 4.1.2. предоставляемые Пользователями с использованием раздела редактирования своих профилей;
- 4.1.3. дополнительно предоставляемые Пользователями по запросу Администрации Платформы в целях исполнения Администрацией Платформы обязательств перед Пользователями, вытекающих из договора на оказание Услуг Платформы. Администрация Платформы вправе, в частности, запросить у Пользователя копию документа, удостоверяющего личность, либо иного документа, содержащего имя, фамилию, фотографию Пользователя, а также иную дополнительную информацию, которая, по усмотрению Администрации Платформы, будет являться необходимой и достаточной для идентификации такого Пользователя и позволит исключить злоупотребления и нарушения прав третьих лиц.
- 4.1.4. Для целей исполнения соглашения с Пользователем по предоставлению Администрацией Платформы отдельных сервисов.

### 4.2. Иная информация о Пользователях, обрабатываемая Администрацией Платформы
Администрация Платформы может также обрабатывать иную информацию о Пользователях, которая включает в себя:
- 4.2.1. дополнительные данные, получаемые при доступе к Платформе, включающие в себя данные о технических средствах (устройствах), технологическом взаимодействии с Платформой (в т.ч. IP-адрес хоста, вид операционной системы пользователя, тип браузера, географическое положение, поставщик услуг Интернета, данные из адресной книги, данные, полученные в результате доступа к камере, микрофону и т.п. устройств), и последующих действиях Пользователя на Платформе.
- 4.2.2. информация, автоматически получаемая при доступе к Платформе с использованием закладок (cookies);
- 4.2.3. информация, создаваемая пользователями на Платформе вне раздела редактирования профиля (в том числе статусы, записи в микроблоге, фотографии, аудиозаписи, видеозаписи, комментарии, записи в обсуждениях групп);
- 4.2.4. информация, полученная в результате действий Пользователя на Платформе (в частности, информация о вступлении на сервер / выходе из сервера, добавлении других Пользователей в список друзей, размещении фотографий, принятии участия / отказа от участия во встречах, добавлении видеозаписей). Данная информация о Пользователе может быть доступна для всех друзей пользователя в соответствии с настройками пользователя;
- 4.2.5. информация, полученная в результате действий других пользователей на Платформе (в частности, отметки, сделанные на видеозаписях и фотографиях другими Пользователями).
- 4.2.6. При использовании Пользователем функциональных возможностей мобильного клиента Платформы, Администрация Платформы применяет технологии (например, ARKit), которые в режиме реального времени отслеживают положение лица на камере в пространстве. При этом Администрация Платформы не собирает, не хранит и не передает третьим лицам какую-либо информацию о лице Пользователя, осуществляя лишь доступ к изображению с камеры устройства Пользователя с использованием указанных технологий для предоставления функциональных возможностей мобильного клиента Платформы.

## 5. Обработка информации о пользователях
5.1. Обработка персональных данных осуществляется на основе принципов:
а) законности целей и способов обработки персональных данных;
б) добросовестности;
в) соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе персональных данных, а также полномочиям Администрации Платформы;
г) соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных данных целям обработки персональных данных;
д) недопустимости объединения созданных для несовместимых между собой целей баз данных, содержащих персональные данные.
### 5.1.1. Условия и цели обработки персональных данных
Администрация Платформы осуществляет обработку персональных данных пользователя в целях исполнения договора между Администрацией Платформы и Пользователем на оказание Услуг Платформы (п. 2.2 Правил пользования Платформой Orbis https:/qwerty/terms). В силу статьи 6 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных» отдельное согласие пользователя на обработку его персональных данных не требуется.
### 5.1.2. Сбор персональных данных
Сбор персональных данных Пользователя осуществляется на Платформе при регистрации, а также в дальнейшем при внесении пользователем по своей инициативе дополнительных сведений о себе с помощью инструментария Платформы.
Персональные данные, предусмотренные п. 4.1.1. настоящих Правил, предоставляются Пользователем и являются минимально необходимыми при регистрации.
Персональные данные, предусмотренные п. 4.1.2. настоящих Правил, дополнительно предоставляются Пользователем по собственной инициативе с использованием вкладки «ред.» в разделе «Моя профиль».
### 5.1.3. Хранение и использование персональных данных
Персональные данные пользователей хранятся исключительно на электронных носителях и обрабатываются с использованием автоматизированных систем, за исключением случаев, когда неавтоматизированная обработка персональных данных необходима в связи с исполнением требований законодательства.
### 5.1.4. Передача персональных данных
Персональные данные Пользователей не передаются никаким другим третьим лицам, за исключением случаев, прямо предусмотренных настоящими Правилами.
При указании Пользователя или при наличии согласия Пользователя возможна передача персональных данных Пользователя третьим лицам — контрагентам Администрации Платформы с условием принятия такими контрагентами обязательств по обеспечению конфиденциальности полученной информации, в частности при использовании приложений.
Приложения, используемые пользователями на Платформе, размещаются и поддерживаются третьими лицами (разработчиками), которые действуют независимо от Администрации Платформы и не выступают от имени или по поручению Администрации Платформы. При этом данные передаются с согласия Пользователя, предоставляемого в форме конклюдентного действия при первом запуске и/или использовании приложения (в частности, при нажатии соответствующей кнопки — при её наличии). Пользователи обязаны самостоятельно ознакомиться с правилами оказания услуг и политикой защиты персональных данных таких третьих лиц (разработчиков) до начала использования соответствующих приложений.
Предоставление персональных данных Пользователей по запросу государственных органов (органов местного самоуправления) осуществляется в порядке, предусмотренном законодательством. В целях исполнения соглашения между Пользователем и Администрацией Платформы и предоставления Пользователю доступа к использованию функциональности Платформы Администрация Платформы развивает предоставляемые сервисы и продукты, разрабатывает и внедряет новые сервисы и продукты, оптимизирует качество сервисов и продуктов, совершенствует доступную функциональность Платформы и сервисов. Для обеспечения реализации указанных целей Пользователь соглашается на осуществление Администрацией Платформы с соблюдением применимого законодательства сервисных рассылок в его адрес (в том числе опросов) с целью получения обратной связи посредством сервисов Администрации Платформы и/или сервисов третьих лиц: электронных сообщений, SMS и иных видов рассылок, — а также сбора, хранения, накопления, систематизации, извлечения, сопоставления, использования, наполнения (уточнения) их данных, а также на получение и передачу аффилированным лицам и партнёрам результатов автоматизированной обработки таких данных с применением различных моделей оценки информации в виде целочисленных и/или текстовых значений и идентификаторов, соответствующих заданным в запросах оценочным критериям, для обработки данных Администрацией Платформы и/или лицами, указанными в настоящем пункте.
Администрация Платформы поручает своим членам обработку собираемых Платформой данных о Пользователе, в объеме, перечисленном в настоящих Правилах, в том числе их обработку совместно с данными о Пользователе, имеющимися в их распоряжении, в объеме, перечисленном в политике(ах) конфиденциальности сервиса(ов) Orbis, которым(ми) пользуется Пользователь, в целях улучшения качества предоставляемых Платформой услуг, а именно: для удовлетворение интересов Пользователя путем показа релевантной интересам Пользователя информации, таргетирования точной рекламы (показа релевантной его интересам информации), формирования обобщенной статистической/ аналитической информации.

### 5.1.5. Уничтожение персональных данных
Персональные данные пользователя уничтожаются при:
– самостоятельном удалении Пользователем данных, размещенных на платформе самим Пользователем;
– самостоятельном удалении Пользователем своей персональной учетной записи с использованием функциональной возможности платформы, доступной Пользователю в разделе «Мои настройки»;
– удалении Администрацией Платформы информации, размещаемой Пользователем, а также персональной учетной записи Пользователя в случаях, установленных Правилами пользования Платформой Orbis https:/цукенг/terms ( п.п. 7.2.2. и 8.6.).
В случае удаления персональной учетной записи Администрация Платформы хранит на своих электронных носителях персональные и иные необходимые данные Пользователя в течение необходимого и установленного действующим законодательством Российской Федерации срока.
В случае самостоятельного удаления своей персональной учетной записи Пользователь вправе восстановить свою персональную учетную запись в течение 210 дней с момента самостоятельного удаления учетной записи в настройках.

5.2. Размещая информацию в персональном профиле, в том числе свои персональные данные, Пользователь осознает и соглашается с тем, что указанная информация может быть доступна другим пользователям сети Интернет с учетом особенностей архитектуры и функционала Платформы. Пользователь самостоятельно определяет режим конфиденциальности и условия доступа к информации, указанной в п.п. 4.2.3 – 4.2.5 настоящих Правил, посредством соответствующих настроек. Администрация Платформы принимает технические и организационные меры по обеспечению функционирования соответствующего инструментария Платформы.


## 6. Права и обязанности пользователей
### 6.1. Пользователи вправе:
6.1.1. осуществлять свободный бесплатный доступ к информации о себе посредством загрузки своих персональных учетных записей на Платформе с использованием логина и пароля;
6.1.2. с помощью инструментария Платформы установить в отношении информации о себе желаемый уровень конфиденциальности (условия доступа к информации) в соответствии с п. 6.3 настоящих Правил;
6.1.3. самостоятельно вносить изменения и исправления в информацию о себе в персональном профиле Пользователя на Платформе, при условии, что такие изменения и исправления содержат актуальную и достоверную информацию;
6.1.4. удалять информацию о себе со своего персонального профиля на Платформе;
6.1.5. требовать от Администрации Платформы уточнения своих персональных данных, их блокирования или уничтожения в случае, если такие данные являются неполными, устаревшими, недостоверными, незаконно полученными или не являются необходимыми для заявленной цели обработки и если невозможно самостоятельно выполнить действия, предусмотренные п.п. 6.1.3. и 6.1.4. настоящих Правил;
6.1.6. на основании запроса получать от Администрации Платформы информацию, касающуюся обработки его персональных данных.

### 6.2 Информация всегда доступна любому зарегистрированному Пользователю Платформы
Поскольку Платформа является универсальным средством коммуникации и главной функцией Платформы является поддержание связи между людьми, следующая информация о зарегистрированном Пользователе всегда доступна любому зарегистрированному Пользователю Платформы:
6.2.1. Псевдоним Пользователя;
6.2.2. дата рождения, профильная фотография, город, записи Пользователя в микроблоге, если Пользователь разместил эту информацию на Платформе в профиле;
6.2.3. список друзей пользователя, за исключением ограниченного перечня друзей, который пользователь предпочел скрыть.

### 6.3. Настройка пользователем уровня конфиденциальности информации о себе
6.3.1. Пользователь вправе, с учетом ограничений, предусмотренных п. 6.2. настоящих Правил, установить в отношении своих персональных данных (п. 4.1. Правил), а также в отношении информации, предусмотренной п.п. 4.2.3. настоящих Правил, один из следующих уровней конфиденциальности:
а) информация доступна всем Пользователям Платформы;
б) информация доступна всем Пользователям Платформы, за исключением определенных Пользователей;
в) информация доступна лицам, имеющим на Платформе статус друзей Пользователя, а также лицам, имеющим статус их друзей;
г) информация доступна только лицам, имеющим на Платформе статус друзей пользователя;
д) информация доступна только некоторым лицам, имеющим на Платформе статус друзей Пользователя;
е) информация доступна только Пользователю.
6.3.2. В отношении информации, закрепленной в п. 6.2. настоящих Правил, Пользователь вправе установить один из следующих уровней конфиденциальности:
а) информация доступна всем пользователям сети Интернет и индексируется поисковыми системами;
б) информация доступна только Пользователям Платформы;
в) информация доступна всем пользователям Интернета, но при этом она не индексируется поисковыми системами.
6.3.3. Администрация Платформы не несет ответственности за разглашение персональных данных Пользователя другими Пользователями Платформы, получившими доступ к таким данным в соответствии с выбранным Пользователем уровнем конфиденциальности.
6.3.4. При удалении персональных данных (иной пользовательской информации) из персонального профиля Пользователя или удалении персональной учетной записи Пользователя с Платформы, информация о Пользователе, скопированная другими Пользователями или хранящаяся в профилях других Пользователей, сохраняется.
6.3.5. Чтобы убедиться в правильности выбранного уровня конфиденциальности, Пользователь может с помощью инструментария Платформы посмотреть, как видят его персональную другие Пользователи.

6.4. Пользователь самостоятельно определяет условия и предоставляет доступ к своим персональным данным неограниченному кругу лиц, в том числе путём регистрации и использования стандартной функциональности, а также с помощью настроек приватности и видимости своего персонального профиля в рамках предоставленной Пользователю функциональности в соответствии с п. 6.3 настоящих Правил. Администрация Платформы не инициирует и не влияет на такой выбор Пользователя, а также не имеет цели получить у Пользователя разрешение на распространение его персональных данных. Обработка персональных данных, сделанных Пользователем доступными неограниченному кругу лиц, осуществляется Администрацией Платформы на основании и в соответствии с условиями Правил пользования Платформой Orbis и настоящих Правил.

## 7. Меры по защите информации о Пользователях
7.1. Администрация Платформы принимает технические и организационно-правовые меры в целях обеспечения защиты персональных данных Пользователя от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий.
7.2. Для авторизации доступа к Платформе используется логин (адрес электронной почты) и пароль Пользователя. Ответственность за сохранность данной информации несет Пользователь. Пользователь не вправе передавать собственный логин и пароль третьим лицам, а также обязан предпринимать меры по обеспечению их конфиденциальности.
7.3. В целях обеспечения более надежной защиты информации о Пользователях Администрация Платформы использует систему привязки учетной записи к  адресу электронной почты. Для осуществления данной системы Пользователь должен предоставить Администрации Платформы свой адрес электронной почты.
В рамках системы привязки учетной записи к  адресу электронной почты Пользователь в случае утраты логина или пароля может восстановить доступ к учетной записи с помощью кода восстановления, содержащегося в письме, которое Пользователь получает на свой адрес электронной почты.
В целях снижения вероятности использования третьими лицами логинов и паролей Пользователей для отсылки спама от их имени, в случае если ввод логина и пароля Пользователя осуществляется с использованием непривычного для данного Пользователя сервера (в частности, сервера иностранного государства), * Администрация Платформы блокирует вход на персональную учетную запись Пользователя при помощи сообщения с требованием указать некоторые цифры, отправленные в письме на адрес электронной почиы Пользователя. После трех неудачных попыток ввода цифр возможность доступа к персональной учетной записи с использованием данного сервера блокируется на 4 часа.
Администрация Платформы также вправе для целей регистрации, авторизации Пользователя, подтверждения актуальности привязанного к персональной учетной записи (верификации) адреса электронной почты, восстановления доступа к персональной учетной записи осуществлять верификационные письма на адрес электронной почты Пользователя. После получения письма Пользователю необходимо ввести код – несколько цифр, указанных в письме, в соответствующем окне. 
7.4. Пользователь вправе получать информацию о том, в какое время и с каких устройств производилась авторизация в его персональную учетную запись, с помощью ссылки «Показать историю активности» в разделе «Мои Настройки / Безопасность».

## 8. Ограничение действия Правил
8.1. Действие настоящих Правил не распространяется на действия и интернет-ресурсы третьих лиц.
8.2. Администрация Платформы не несет ответственности за действия третьих лиц, получивших в результате использования Интернета или Услуг Платформы доступ к информации о Пользователе в соответствии с выбранным Пользователем уровнем конфиденциальности, за последствия использования информации, которая, в силу природы Платформы, доступна любому пользователю сети Интернет. Администрация Платформы рекомендует Пользователям ответственно подходить к решению вопроса об объеме информации о себе, размещаемой на Платформе.

## 9. Обращения пользователей
9.1. Пользователи вправе направлять Администрации Платформы свои запросы, в том числе запросы относительно использования их персональных данных, предусмотренные п. 6.1.6 настоящих Правил,  в форме электронного документа, подписанного квалифицированной электронной подписью в соответствии с законодательством Российской Федерации, по адресу электронной почты: supportфывфывфывфыom.
9.2. Запрос, направляемый пользователем, должен содержать следующую информацию:
номер основного документа, удостоверяющего личность пользователя или его представителя;
- сведения о дате выдачи указанного документа и выдавшем его органе;
- сведения, подтверждающие участие пользователя в отношениях с оператором (в частности, порядковый номер id пользователя или короткое (поддоменное) имя, заменяющее порядковый номер id);
- подпись пользователя или его представителя.

9.3. Администрация Платформы обязуется рассмотреть и направить ответ на поступивший запрос пользователя в течение 30 дней с момента поступления обращения.
9.4. Вся корреспонденция, полученная Администрацией Платформы от пользователей (обращения в письменной или электронной форме), относится к информации ограниченного доступа и не разглашается без письменного согласия Пользователя. Персональные данные и иная информация о Пользователе, направившем запрос, не могут быть без специального согласия Пользователя использованы иначе, как для ответа по теме полученного запроса или в случаях, прямо предусмотренных законодательством.`;

export const PrivacyPage: React.FC = () => {
    return (
        <div className="Terms">
            <ArticleNavigator />
            <Article
                title={title}
                description={description}
                content={content}
            />
        </div>
    );
};
